swiper_app/app/views/groups/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "group_users" ON "users"."id" = "group_users"."user_id" WHERE "group_users"."group_id" = ?  [["group_id", 1]]
---
        <% unless @group_owner == current_user %>
          <% if @group.users.include?(current_user) %>