bookers2_phase2_debug_rails6-main/app/views/users/_userbooks.html.erb

     <td class ='example'>
       <span>コメント数：<%= book.book_comments.count %></span>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]