bookers2_phase2_debug_rails6-main/lib/batch/data_reset.rb

  def self.data_reset
    # 投稿を全て削除
    Category.delete_all
---
DELETE FROM "categories"