bookers2_phase2_debug_rails6-main/app/models/user.rb

  def liked_by?(book_id)
    self.favorites.where(book_id: book_id).exists?
---
SELECT 1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 2], ["book_id", 1], ["LIMIT", 1]]