bookers2_phase2_debug_rails6-main/app/views/favorites/_like.html.erb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" IN (?, ?)  [["book_id", 1], ["book_id", 2]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
   <%= link_to book_favorites_path(book), method: :delete , remote: true do %>
    <i class="fa-solid fa-heart"></i><%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
   <%= link_to book_favorites_path(book), method: :post , remote: true do %>
    <i class="fa-regular fa-heart"></i><%= book.favorites.count %>