bookers2_phase2_debug_rails6-main/app/views/books/_index.html.erb

      <td class ='example'>
        コメント数：<%=book.book_comments.count %>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]

      <td>
        <% book.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "tag_books" ON "tags"."id" = "tag_books"."tag_id" WHERE "tag_books"."book_id" = ?  [["book_id", 2]]