swiper_app/app/controllers/books_controller.rb

SELECT "books".* FROM "books"
SELECT "categories".* FROM "categories" ORDER BY "categories"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at", "rate", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "aaa"], ["body", "aaa"], ["user_id", 3], ["created_at", "2024-05-07 00:31:37.999966"], ["updated_at", "2024-05-07 00:31:37.999966"], ["rate", 2.0], ["category_id", 1]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "tag"], ["created_at", "2024-05-07 00:31:38.013212"], ["updated_at", "2024-05-07 00:31:38.013212"]]
---
  def create
    @user = current_user
    @books = Book.all
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    @book.category = Category.first

    tag_names = params[:book][:tag_name].split(',')

    if @book.save
        @book.save_tags(tag_names)

SELECT "books".* FROM "books" ORDER BY created_at DESC
SELECT "books".* FROM "books"
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 2], ["id", 3]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" IN (?, ?, ?, ?)  [["book_id", 1], ["book_id", 2], ["book_id", 3], ["book_id", 4]]
SELECT COUNT(*) FROM "users" INNER JOIN "favorites" ON "users"."id" = "favorites"."user_id" WHERE "favorites"."book_id" = ? AND "users"."created_at" >= ? AND "users"."created_at" < ?  [["book_id", 2], ["created_at", "2024-05-01 00:00:00"], ["created_at", "2024-05-07 23:59:59.999999"]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" IN (?, ?)  [["book_id", 1], ["book_id", 2]]
SELECT COUNT(*) FROM "users" INNER JOIN "favorites" ON "users"."id" = "favorites"."user_id" WHERE "favorites"."book_id" = ? AND "users"."created_at" >= ? AND "users"."created_at" < ?  [["book_id", 1], ["created_at", "2024-05-01 00:00:00"], ["created_at", "2024-05-07 23:59:59.999999"]]
---
  def index
    @user = current_user
    @book = Book.new
    @categories = Category.all

  if params[:sort]
     @books = Book.all.order(params[:sort])
  else
    to = Time.current.at_end_of_day
    from = (to - 6.day).at_beginning_of_day
    @books = Book.all.includes(:favorited_users).
      sort {|a,b|
        b.favorited_users.includes(:favorites).where(created_at: from...to).size <=>
        a.favorited_users.includes(:favorites).where(created_at: from...to).size

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @categories = Category.all
    @book = Book.new
    @user_book = Book.find(params[:id])
    @user = @user_book.user
    @book_comments = @user_book.book_comments.all

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @book=Book.find(params[:id])

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "aaaadddd"], ["updated_at", "2024-05-05 22:53:05.725115"], ["id", 1]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
---
  def destroy
    book = Book.find(params[:id])
    book.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
   def baria_book
     unless Book.find(params[:id]).user_id == current_user.id