swiper_app/app/controllers/tags_controller.rb

SELECT "books".* FROM "books" INNER JOIN "tag_books" ON "tag_books"."book_id" = "books"."id" INNER JOIN "tags" ON "tags"."id" = "tag_books"."tag_id" WHERE (tags.name LIKE '% ddd%')
---
  def search
    @word = params[:word]
    @books = Book.joins(:tags).where("tags.name LIKE ?", "%#{@word}%")