swiper_app/app/controllers/users_controller.rb

SELECT "categories".* FROM "categories"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = ? AND "books"."created_at" BETWEEN ? AND ?  [["user_id", 1], ["created_at", "2024-05-05 00:00:00"], ["created_at", "2024-05-05 23:59:59.999999"]]
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = ? AND "books"."created_at" BETWEEN ? AND ?  [["user_id", 1], ["created_at", "2024-05-04 00:00:00"], ["created_at", "2024-05-04 23:59:59.999999"]]
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = ? AND "books"."created_at" BETWEEN ? AND ?  [["user_id", 1], ["created_at", "2024-05-03 00:00:00"], ["created_at", "2024-05-03 23:59:59.999999"]]
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = ? AND "books"."created_at" BETWEEN ? AND ?  [["user_id", 1], ["created_at", "2024-05-02 00:00:00"], ["created_at", "2024-05-02 23:59:59.999999"]]
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = ? AND "books"."created_at" BETWEEN ? AND ?  [["user_id", 1], ["created_at", "2024-05-01 00:00:00"], ["created_at", "2024-05-01 23:59:59.999999"]]
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = ? AND "books"."created_at" BETWEEN ? AND ?  [["user_id", 1], ["created_at", "2024-04-30 00:00:00"], ["created_at", "2024-04-30 23:59:59.999999"]]
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = ? AND "books"."created_at" BETWEEN ? AND ?  [["user_id", 1], ["created_at", "2024-04-29 00:00:00"], ["created_at", "2024-04-29 23:59:59.999999"]]
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = ? AND "books"."created_at" >= ? AND "books"."created_at" < ?  [["user_id", 2], ["created_at", "2024-04-30 23:59:59.999999"], ["created_at", "2024-05-07 23:59:59.999999"]]
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = ? AND "books"."created_at" >= ? AND "books"."created_at" < ?  [["user_id", 2], ["created_at", "2024-04-23 23:59:59.999999"], ["created_at", "2024-04-30 23:59:59.999999"]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" IN (?, ?, ?)  [["book_id", 3], ["book_id", 4], ["book_id", 5]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 2]]
---
  def show
    @categories = Category.all
    @user = User.find(params[:id])

  # 今日から６日前の投稿数、前日比計算
    @today_book_count          = @user.books.created_at_today.count
    @yesterday_book_count      = @user.books.created_at_yesterday.count
    @two_days_ago_book_count   = @user.books.created_at_two_days_ago.count
    @three_days_ago_book_count = @user.books.created_at_three_days_ago.count
    @four_days_ago_book_count  = @user.books.created_at_four_days_ago.count
    @five_days_ago_book_count  = @user.books.created_at_five_days_ago.count
    @six_days_ago_book_count   = @user.books.created_at_six_days_ago.count

    unless @yesterday_book_count == 0
      @day_before = (@today_book_count.to_f / @yesterday_book_count.to_f).round * 100
    end

    # 今週と先週の投稿数、前週比
    @week_book_count      = @user.books.created_at_week.count
    @last_week_book_count = @user.books.created_at_last_week.count

    unless @last_week_book_count == 0
      @week_before = (@week_book_count.to_f / @last_week_book_count.to_f).round * 100
    end

    @book = Book.new
    @user_books = Book.where(user_id:params[:id]).includes(:favorited_users).sort{|a,b| b.favorited_users.size <=> a.favorited_users.size}
    # @user_books = Book.includes(:favorited_users).sort{|a,b| b.favorited_users.size <=> a.favorited_users.size}
    #上記を追記すると、Book.allが呼び出されてしまう。なので、user.bookを呼び出してから、並び替えの記述をする。
    @current_entry = Entry.where(user_id: current_user.id)
    # Entryモデルからメッセージ相手のレコードを抽出
    @another_entry = Entry.where(user_id: @user.id)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = ? AND (created_at LIKE '2024-05-06%')  [["user_id", 2]]
---
  def search
    @user = User.find(params[:user_id])

    if params[:created_at] == ""
      @book_counts = "値を入力してください"
    else
      created_at = params[:created_at]
      @book_counts = @user.books.where("created_at LIKE ?", "#{created_at}%").count

SELECT "users".* FROM "users"
---
  def index
    @categories = Category.all
    @user  = current_user
    @book  = Book.new
    @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "aaaaddd"], ["introduction", "ddd"], ["updated_at", "2024-05-05 22:53:22.952933"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def follows
    user   = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def followers
    user   = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def baria_user
    unless User.find(params[:id]).id == current_user.id