swiper_app/app/models/book.rb

  def save_tags(tag_names)
    tag_names.each do |new_tag_name|
      tags.find_or_create_by(name: new_tag_name)
---
INSERT INTO "tag_books" ("tag_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tag_id", 2], ["book_id", 5], ["created_at", "2024-05-07 00:34:07.662400"], ["updated_at", "2024-05-07 00:34:07.662400"]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "tag"], ["created_at", "2024-05-07 00:31:38.013212"], ["updated_at", "2024-05-07 00:31:38.013212"]]